In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_excel("rentdata11.xlsx")

In [4]:
df.shape

(682, 2)

In [5]:
df.head()

     Rent                        Location
0  $1,750     70 Temperance St, Unit 4116
1  $1,750     70 Temperance St, Unit 4116
2  $1,900  197 Yonge Street St, Unit 2104
3  $1,700        403 Church St, Unit 1711
4  $2,100           25 Oxley St, Unit 413

In [6]:
df = df.drop_duplicates()

In [7]:
df.shape

(660, 2)

In [8]:
df.head()

     Rent                        Location
0  $1,750     70 Temperance St, Unit 4116
2  $1,900  197 Yonge Street St, Unit 2104
3  $1,700        403 Church St, Unit 1711
4  $2,100           25 Oxley St, Unit 413
5  $1,950          87 Peter St, Unit 2701

In [9]:
df.to_excel('cleaned_rental_data.xlsx', index=False)

In [22]:
!pip install googlemaps

from googlemaps import Client as GoogleMaps
import pandas as pd

Requirement already satisfied: googlemaps in /Users/abhishekpadala/anaconda3/lib/python3.8/site-packages (4.4.2)
Requirement already satisfied: requests<3.0,>=2.20.0 in /Users/abhishekpadala/anaconda3/lib/python3.8/site-packages (from googlemaps) (2.24.0)
Requirement already satisfied: chardet<4,>=3.0.2 in /Users/abhishekpadala/anaconda3/lib/python3.8/site-packages (from requests<3.0,>=2.20.0->googlemaps) (3.0.4)
Requirement already satisfied: idna<3,>=2.5 in /Users/abhishekpadala/anaconda3/lib/python3.8/site-packages (from requests<3.0,>=2.20.0->googlemaps) (2.10)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /Users/abhishekpadala/anaconda3/lib/python3.8/site-packages (from requests<3.0,>=2.20.0->googlemaps) (1.25.9)
Requirement already satisfied: certifi>=2017.4.17 in /Users/abhishekpadala/anaconda3/lib/python3.8/site-packages (from requests<3.0,>=2.20.0->googlemaps) (2020.6.20)

In [41]:
gmaps = GoogleMaps('AIzaSyAkvZx2djtUqFuqfOinWFBs356DunFdjCI')
rental_data = pd.read_excel("cleaned_rental_data.xlsx")

In [42]:
rental_data.head()

     Rent                        Location
0  $1,750     70 Temperance St, Unit 4116
1  $1,900  197 Yonge Street St, Unit 2104
2  $1,700        403 Church St, Unit 1711
3  $2,100           25 Oxley St, Unit 413
4  $1,950          87 Peter St, Unit 2701

In [43]:
rental_data['Location'] = pd.concat([rental_data['Location'] + ',Toronto,Ontario'],ignore_index= False, sort= False)
rental_data.head()

     Rent                                        Location
0  $1,750     70 Temperance St, Unit 4116,Toronto,Ontario
1  $1,900  197 Yonge Street St, Unit 2104,Toronto,Ontario
2  $1,700        403 Church St, Unit 1711,Toronto,Ontario
3  $2,100           25 Oxley St, Unit 413,Toronto,Ontario
4  $1,950          87 Peter St, Unit 2701,Toronto,Ontario

In [44]:
rental_data['lat'] = ""
rental_data['long'] = ""
for x in range(len(rental_data)):
    try:
        geocode_result = gmaps.geocode(rental_data['Location'][x])
        rental_data['lat'][x] = geocode_result[0]['geometry']['location'] ['lat']
        rental_data['long'][x] = geocode_result[0]['geometry']['location']['lng']
    except IndexError:
        print("Address was wrong...")
    except Exception as e:
        print("Unexpected error occurred.", e )
rental_data

       Rent                                         Location      lat     long
0    $1,750      70 Temperance St, Unit 4116,Toronto,Ontario  43.6505 -79.3821
1    $1,900   197 Yonge Street St, Unit 2104,Toronto,Ontario  43.6535 -79.3792
2    $1,700         403 Church St, Unit 1711,Toronto,Ontario  43.6621 -79.3793
3    $2,100            25 Oxley St, Unit 413,Toronto,Ontario  43.6462 -79.3945
4    $1,950           87 Peter St, Unit 2701,Toronto,Ontario  43.6469 -79.3924
..      ...                                              ...      ...      ...
655  $1,800         21 Carlton St, Unit 2604,Toronto,Ontario  43.6611 -79.3821
656  $1,950      70 Temperance St, Unit 1616,Toronto,Ontario  43.6505 -79.3821
657  $2,000  318 Richmond St W St, Unit 3302,Toronto,Ontario  43.6489 -79.3922
658  $1,850            763 Bay St, Unit 1107,Toronto,Ontario  43.6599 -79.3852
659  $1,750       210 Victoria St, Unit 2209,Toronto,Ontario  43.6546 -79.3791

[660 rows x 4 columns]

In [45]:
rental_data.to_excel('rental_data.xlsx')